{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>NotUsedData</th>\n",
       "      <th>class_grade</th>\n",
       "      <th>class_name</th>\n",
       "      <th>class_number</th>\n",
       "      <th>class_room_number</th>\n",
       "      <th>f_pickup</th>\n",
       "      <th>father_age</th>\n",
       "      <th>father_name</th>\n",
       "      <th>father_type</th>\n",
       "      <th>m_pickup</th>\n",
       "      <th>...</th>\n",
       "      <th>studen_dob</th>\n",
       "      <th>student_gpa</th>\n",
       "      <th>student_grade</th>\n",
       "      <th>student_id</th>\n",
       "      <th>student_name</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <th>teacher_id</th>\n",
       "      <th>teacher_name</th>\n",
       "      <th>years_teaching</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Test</td>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>MA301</td>\n",
       "      <td>303.0</td>\n",
       "      <td>False</td>\n",
       "      <td>72</td>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>...</td>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>3.8</td>\n",
       "      <td>12</td>\n",
       "      <td>1234</td>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>t234f</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>MA301</td>\n",
       "      <td>303.0</td>\n",
       "      <td>True</td>\n",
       "      <td>52</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Step</td>\n",
       "      <td>True</td>\n",
       "      <td>...</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>3.7</td>\n",
       "      <td>12</td>\n",
       "      <td>1233434</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>t234f</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>12.0</td>\n",
       "      <td>English</td>\n",
       "      <td>EN230</td>\n",
       "      <td>43.0</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>...</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>3.2</td>\n",
       "      <td>9</td>\n",
       "      <td>12534</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>English</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>t232323234f</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>11.0</td>\n",
       "      <td>American History</td>\n",
       "      <td>HIS432</td>\n",
       "      <td>423.0</td>\n",
       "      <td>True</td>\n",
       "      <td>49</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>12324</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>History</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>twsv234f</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Ace Colbert</td>\n",
       "      <td>Step</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>12324</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 25 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "  NotUsedData  class_grade        class_name class_number  class_room_number  \\\n",
       "0        Test         12.0        Algebra II        MA301              303.0   \n",
       "1         NaN         12.0        Algebra II        MA301              303.0   \n",
       "2         NaN         12.0           English        EN230               43.0   \n",
       "3         NaN         11.0  American History       HIS432              423.0   \n",
       "4         NaN          NaN               NaN          NaN                NaN   \n",
       "\n",
       "   f_pickup  father_age    father_name father_type m_pickup      ...        \\\n",
       "0     False          72      Paul Camp       Birth     True      ...         \n",
       "1      True          52  Paul Billings        Step     True      ...         \n",
       "2      True          32      Bob Jones       Birth     True      ...         \n",
       "3      True          49    Gary Carell       Birth      NaN      ...         \n",
       "4      True          32    Ace Colbert        Step      NaN      ...         \n",
       "\n",
       "   studen_dob student_gpa student_grade student_id   student_name  \\\n",
       "0  12/01/2001         3.8            12       1234      Matt Camp   \n",
       "1   2/01/2001         3.7            12    1233434  Matt Billings   \n",
       "2  12/01/2004         3.2             9      12534    Jesse Jones   \n",
       "3  12/01/2003         2.9             9      12324    Billy Jones   \n",
       "4  12/01/2003         2.9             9      12324    Billy Jones   \n",
       "\n",
       "  teacher_degree  teacher_employment_date   teacher_id   teacher_name  \\\n",
       "0           Math               08/01/1998        t234f   Kathy Fisher   \n",
       "1           Math               08/01/1998        t234f   Kathy Fisher   \n",
       "2        English               08/01/1999  t232323234f    Marie Daily   \n",
       "3        History               08/01/1988     twsv234f  Kathy Freeley   \n",
       "4            NaN                      NaN          NaN            NaN   \n",
       "\n",
       "  years_teaching  \n",
       "0           15.0  \n",
       "1           15.0  \n",
       "2            3.0  \n",
       "3            1.0  \n",
       "4            NaN  \n",
       "\n",
       "[5 rows x 25 columns]"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import datetime\n",
    "import pandas as pd\n",
    "\n",
    "data_model = [\n",
    "    dict(\n",
    "        label=[\"Person\", \"Student\"],\n",
    "        data_fields=[\"student_id\", \"student_name\", \"studen_dob\", \"student_grade\", \"student_gpa\"],\n",
    "        property_fields=[\"id\", \"name\", \"dob\", \"grade\", \"class_grade\"],\n",
    "        relationships=[\n",
    "            (\"Person:Student\", \"_IS_MEMBER_OF_\", \"Class\"),\n",
    "            (\"Person:Student\", \"_ATTENDS_\", \"School\")\n",
    "        ],\n",
    "        key=[\"id\"],\n",
    "        required_properties=[\"id\", \"name\", \"dob\", \"grade\"],\n",
    "        unique_properties=[\"id\"]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Teacher\"],\n",
    "        data_fields=[\"teacher_id\", \"teacher_name\", \"teacher_degree\", \"teacher_employment_date\"],\n",
    "        property_fields=[\"id\", \"name\", \"degree\", \"employment_date\"],\n",
    "        relationships=[\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Class\", \n",
    "                dict(\n",
    "                    data_fields=[\"years_teaching\"],\n",
    "                    property_fields=[\"years_teaching\"]\n",
    "                )),\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Person:Student\")\n",
    "        ],\n",
    "        key=[\"id\"],\n",
    "        required_properties=[\"id\", \"name\"],\n",
    "        unique_properties=[\"id\"]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Class\"],\n",
    "        data_fields=[\"class_number\", \"class_name\", \"class_grade\"],\n",
    "        property_fields=[\"number\", \"subject\", \"grade\"],\n",
    "        relationships=[\n",
    "            (\n",
    "                \"Class\", \"_IS_AT_\", \"School\", \n",
    "                dict(\n",
    "                    data_fields=[\"class_room_number\"],\n",
    "                    property_fields=[\"room_number\"]\n",
    "                )\n",
    "            )\n",
    "        ],\n",
    "        key=[],\n",
    "        required_properties=[\"number\", \"subject\", \"grade\"],\n",
    "        unique_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Father\"],\n",
    "        data_fields=[\"father_name\", \"father_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Father\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"father_type\", \"f_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        key=[],\n",
    "        required_properties=[\"name\"],\n",
    "        unique_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Mother\"],\n",
    "        data_fields=[\"mother_name\", \"mother_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Mother\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"mother_type\", \"m_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        key=[],\n",
    "        required_properties=[\"name\"],\n",
    "        unique_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"School\"],\n",
    "        data_fields=[\"school_name\", \"school_address\"],\n",
    "        property_fields=[\"name\", \"address\"],\n",
    "        relationships=[\n",
    "        ],\n",
    "        key=[\"name\", \"address\"],\n",
    "        required_properties=[\"name\", \"address\"],\n",
    "        unique_properties=[\"name\", \"address\"]\n",
    "    )\n",
    "]\n",
    "\n",
    "school_data = pd.DataFrame([\n",
    "    {\n",
    "        \"student_id\": \"1234\", \"student_name\": \"Matt Camp\", \"studen_dob\": \"12/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.8,\n",
    "        \"teacher_id\": \"t234f\", \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_number\": \"MA301\", \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Camp\", \"father_age\": 72,\n",
    "        \"mother_name\": \"Helen Camp\", \"mother_age\": 49,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": False,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True,\n",
    "        \"NotUsedData\": \"Test\"\n",
    "    },\n",
    "    {\n",
    "        \"student_id\": \"1233434\", \"student_name\": \"Matt Billings\", \"studen_dob\": \"2/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.7,\n",
    "        \"teacher_id\": \"t234f\", \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_number\": \"MA301\", \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Billings\", \"father_age\": 52,\n",
    "        \"mother_name\": \"Helen Billings\", \"mother_age\": 43,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_id\": \"12534\", \"student_name\": \"Jesse Jones\", \"studen_dob\": \"12/01/2004\", \"student_grade\": 9, \"student_gpa\": 3.2,\n",
    "        \"teacher_id\": \"t232323234f\", \"teacher_name\": \"Marie Daily\", \"teacher_degree\": \"English\", \"teacher_employment_date\": \"08/01/1999\",\n",
    "        \"class_number\": \"EN230\", \"class_name\": \"English\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Bob Jones\", \"father_age\": 32,\n",
    "        \"mother_name\": \"Mary Jones\", \"mother_age\": 39,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 43,\n",
    "        \"years_teaching\": 3,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_id\": \"12324\", \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"teacher_id\": \"twsv234f\", \"teacher_name\": \"Kathy Freeley\", \"teacher_degree\": \"History\", \"teacher_employment_date\": \"08/01/1988\",\n",
    "        \"class_number\": \"HIS432\",\"class_name\": \"American History\", \"class_grade\": 11,\n",
    "        \"father_name\": \"Gary Carell\", \"father_age\": 49,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 423,\n",
    "        \"years_teaching\": 1,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_id\": \"12324\", \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"father_name\": \"Ace Colbert\", \"father_age\": 32,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True\n",
    "    }\n",
    "\n",
    "])\n",
    "school_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The autoreload extension is already loaded. To reload it, use:\n",
      "  %reload_ext autoreload\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr:last-of-type th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>pk</th>\n",
       "      <th>Matt Camp</th>\n",
       "      <th>Matt Billings</th>\n",
       "      <th>Jesse Jones</th>\n",
       "      <th colspan=\"2\" halign=\"left\">Billy Jones</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>node</th>\n",
       "      <th>property</th>\n",
       "      <th>data_field</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>UnusedFields</th>\n",
       "      <th>ignored</th>\n",
       "      <th>NotUsedData</th>\n",
       "      <td>Test</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">School</th>\n",
       "      <th>name</th>\n",
       "      <th>school_name</th>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>address</th>\n",
       "      <th>school_address</th>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"4\" valign=\"top\">Person:Teacher</th>\n",
       "      <th>id</th>\n",
       "      <th>teacher_id</th>\n",
       "      <td>t234f</td>\n",
       "      <td>t234f</td>\n",
       "      <td>t232323234f</td>\n",
       "      <td>twsv234f</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>employment_date</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>degree</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <td>Math</td>\n",
       "      <td>Math</td>\n",
       "      <td>English</td>\n",
       "      <td>History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>teacher_name</th>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"5\" valign=\"top\">Person:Student</th>\n",
       "      <th>name</th>\n",
       "      <th>student_name</th>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>dob</th>\n",
       "      <th>studen_dob</th>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>12/01/2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>class_grade</th>\n",
       "      <th>student_gpa</th>\n",
       "      <td>3.8</td>\n",
       "      <td>3.7</td>\n",
       "      <td>3.2</td>\n",
       "      <td>2.9</td>\n",
       "      <td>2.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>grade</th>\n",
       "      <th>student_grade</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>id</th>\n",
       "      <th>student_id</th>\n",
       "      <td>1234</td>\n",
       "      <td>1233434</td>\n",
       "      <td>12534</td>\n",
       "      <td>12324</td>\n",
       "      <td>12324</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Mother</th>\n",
       "      <th>age</th>\n",
       "      <th>mother_age</th>\n",
       "      <td>49</td>\n",
       "      <td>43</td>\n",
       "      <td>39</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>mother_name</th>\n",
       "      <td>Helen Camp</td>\n",
       "      <td>Helen Billings</td>\n",
       "      <td>Mary Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Father</th>\n",
       "      <th>age</th>\n",
       "      <th>father_age</th>\n",
       "      <td>72</td>\n",
       "      <td>52</td>\n",
       "      <td>32</td>\n",
       "      <td>49</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>father_name</th>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Ace Colbert</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Class</th>\n",
       "      <th>grade</th>\n",
       "      <th>class_grade</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>11</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>number</th>\n",
       "      <th>class_number</th>\n",
       "      <td>MA301</td>\n",
       "      <td>MA301</td>\n",
       "      <td>EN230</td>\n",
       "      <td>HIS432</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>subject</th>\n",
       "      <th>class_name</th>\n",
       "      <td>Algebra II</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>English</td>\n",
       "      <td>American History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Person:Teacher', '_TEACHES_', 'Class')</th>\n",
       "      <th>years_teaching</th>\n",
       "      <th>years_teaching</th>\n",
       "      <td>15</td>\n",
       "      <td>15</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Mother', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>pickup</th>\n",
       "      <th>m_pickup</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>parent_type</th>\n",
       "      <th>mother_type</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Father', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>parent_type</th>\n",
       "      <th>father_type</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>pickup</th>\n",
       "      <th>f_pickup</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Class', '_IS_AT_', 'School')</th>\n",
       "      <th>room_number</th>\n",
       "      <th>class_room_number</th>\n",
       "      <td>303</td>\n",
       "      <td>303</td>\n",
       "      <td>43</td>\n",
       "      <td>423</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "pk                                                                                                                       Matt Camp  \\\n",
       "index                                                                                                                            0   \n",
       "node                                               property        data_field                                                        \n",
       "UnusedFields                                       ignored         NotUsedData                                                Test   \n",
       "School                                             name            school_name                              Notre Dame High School   \n",
       "                                                   address         school_address           1234 Harvard Way, Chattanooga TN 35761   \n",
       "Person:Teacher                                     id              teacher_id                                                t234f   \n",
       "                                                   employment_date teacher_employment_date                              08/01/1998   \n",
       "                                                   degree          teacher_degree                                             Math   \n",
       "                                                   name            teacher_name                                       Kathy Fisher   \n",
       "Person:Student                                     name            student_name                                          Matt Camp   \n",
       "                                                   dob             studen_dob                                           12/01/2001   \n",
       "                                                   class_grade     student_gpa                                                 3.8   \n",
       "                                                   grade           student_grade                                                12   \n",
       "                                                   id              student_id                                                 1234   \n",
       "Person:Parent:Mother                               age             mother_age                                                   49   \n",
       "                                                   name            mother_name                                          Helen Camp   \n",
       "Person:Parent:Father                               age             father_age                                                   72   \n",
       "                                                   name            father_name                                           Paul Camp   \n",
       "Class                                              grade           class_grade                                                  12   \n",
       "                                                   number          class_number                                              MA301   \n",
       "                                                   subject         class_name                                           Algebra II   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               15   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                   True   \n",
       "                                                   parent_type     mother_type                                               Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                               Birth   \n",
       "                                                   pickup          f_pickup                                                  False   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                           303   \n",
       "\n",
       "pk                                                                                                                   Matt Billings  \\\n",
       "index                                                                                                                            1   \n",
       "node                                               property        data_field                                                        \n",
       "UnusedFields                                       ignored         NotUsedData                                                 NaN   \n",
       "School                                             name            school_name                              Notre Dame High School   \n",
       "                                                   address         school_address           1234 Harvard Way, Chattanooga TN 35761   \n",
       "Person:Teacher                                     id              teacher_id                                                t234f   \n",
       "                                                   employment_date teacher_employment_date                              08/01/1998   \n",
       "                                                   degree          teacher_degree                                             Math   \n",
       "                                                   name            teacher_name                                       Kathy Fisher   \n",
       "Person:Student                                     name            student_name                                      Matt Billings   \n",
       "                                                   dob             studen_dob                                            2/01/2001   \n",
       "                                                   class_grade     student_gpa                                                 3.7   \n",
       "                                                   grade           student_grade                                                12   \n",
       "                                                   id              student_id                                              1233434   \n",
       "Person:Parent:Mother                               age             mother_age                                                   43   \n",
       "                                                   name            mother_name                                      Helen Billings   \n",
       "Person:Parent:Father                               age             father_age                                                   52   \n",
       "                                                   name            father_name                                       Paul Billings   \n",
       "Class                                              grade           class_grade                                                  12   \n",
       "                                                   number          class_number                                              MA301   \n",
       "                                                   subject         class_name                                           Algebra II   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               15   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                   True   \n",
       "                                                   parent_type     mother_type                                               Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                                Step   \n",
       "                                                   pickup          f_pickup                                                   True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                           303   \n",
       "\n",
       "pk                                                                                                                  Jesse Jones  \\\n",
       "index                                                                                                                         2   \n",
       "node                                               property        data_field                                                     \n",
       "UnusedFields                                       ignored         NotUsedData                                              NaN   \n",
       "School                                             name            school_name                        Sudden Valley High School   \n",
       "                                                   address         school_address           1234 Jones Road, Nashville TN 35761   \n",
       "Person:Teacher                                     id              teacher_id                                       t232323234f   \n",
       "                                                   employment_date teacher_employment_date                           08/01/1999   \n",
       "                                                   degree          teacher_degree                                       English   \n",
       "                                                   name            teacher_name                                     Marie Daily   \n",
       "Person:Student                                     name            student_name                                     Jesse Jones   \n",
       "                                                   dob             studen_dob                                        12/01/2004   \n",
       "                                                   class_grade     student_gpa                                              3.2   \n",
       "                                                   grade           student_grade                                              9   \n",
       "                                                   id              student_id                                             12534   \n",
       "Person:Parent:Mother                               age             mother_age                                                39   \n",
       "                                                   name            mother_name                                       Mary Jones   \n",
       "Person:Parent:Father                               age             father_age                                                32   \n",
       "                                                   name            father_name                                        Bob Jones   \n",
       "Class                                              grade           class_grade                                               12   \n",
       "                                                   number          class_number                                           EN230   \n",
       "                                                   subject         class_name                                           English   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             3   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                True   \n",
       "                                                   parent_type     mother_type                                            Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                            Birth   \n",
       "                                                   pickup          f_pickup                                                True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                         43   \n",
       "\n",
       "pk                                                                                                                  Billy Jones  \\\n",
       "index                                                                                                                         3   \n",
       "node                                               property        data_field                                                     \n",
       "UnusedFields                                       ignored         NotUsedData                                              NaN   \n",
       "School                                             name            school_name                        Sudden Valley High School   \n",
       "                                                   address         school_address           1234 Jones Road, Nashville TN 35761   \n",
       "Person:Teacher                                     id              teacher_id                                          twsv234f   \n",
       "                                                   employment_date teacher_employment_date                           08/01/1988   \n",
       "                                                   degree          teacher_degree                                       History   \n",
       "                                                   name            teacher_name                                   Kathy Freeley   \n",
       "Person:Student                                     name            student_name                                     Billy Jones   \n",
       "                                                   dob             studen_dob                                        12/01/2003   \n",
       "                                                   class_grade     student_gpa                                              2.9   \n",
       "                                                   grade           student_grade                                              9   \n",
       "                                                   id              student_id                                             12324   \n",
       "Person:Parent:Mother                               age             mother_age                                               NaN   \n",
       "                                                   name            mother_name                                              NaN   \n",
       "Person:Parent:Father                               age             father_age                                                49   \n",
       "                                                   name            father_name                                      Gary Carell   \n",
       "Class                                              grade           class_grade                                               11   \n",
       "                                                   number          class_number                                          HIS432   \n",
       "                                                   subject         class_name                                  American History   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             1   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                 NaN   \n",
       "                                                   parent_type     mother_type                                              NaN   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                            Birth   \n",
       "                                                   pickup          f_pickup                                                True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                        423   \n",
       "\n",
       "pk                                                                                                       \n",
       "index                                                                                                 4  \n",
       "node                                               property        data_field                            \n",
       "UnusedFields                                       ignored         NotUsedData                      NaN  \n",
       "School                                             name            school_name                      NaN  \n",
       "                                                   address         school_address                   NaN  \n",
       "Person:Teacher                                     id              teacher_id                       NaN  \n",
       "                                                   employment_date teacher_employment_date          NaN  \n",
       "                                                   degree          teacher_degree                   NaN  \n",
       "                                                   name            teacher_name                     NaN  \n",
       "Person:Student                                     name            student_name             Billy Jones  \n",
       "                                                   dob             studen_dob                12/01/2003  \n",
       "                                                   class_grade     student_gpa                      2.9  \n",
       "                                                   grade           student_grade                      9  \n",
       "                                                   id              student_id                     12324  \n",
       "Person:Parent:Mother                               age             mother_age                       NaN  \n",
       "                                                   name            mother_name                      NaN  \n",
       "Person:Parent:Father                               age             father_age                        32  \n",
       "                                                   name            father_name              Ace Colbert  \n",
       "Class                                              grade           class_grade                      NaN  \n",
       "                                                   number          class_number                     NaN  \n",
       "                                                   subject         class_name                       NaN  \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                   NaN  \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                         NaN  \n",
       "                                                   parent_type     mother_type                      NaN  \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                     Step  \n",
       "                                                   pickup          f_pickup                        True  \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                NaN  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2\n",
    "from SevenBridges import *\n",
    "dm = apply_data_model(school_data, data_model, \"student_name\")\n",
    "dm.T.sort_values([('node')], ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "    dict(\n",
    "        label=[\"Person\", \"Student\"],\n",
    "        data_fields=[\"student_id\", \"student_name\", \"studen_dob\", \"student_grade\", \"student_gpa\"],\n",
    "        property_fields=[\"id\", \"name\", \"dob\", \"grade\", \"class_grade\"],\n",
    "        relationships=[\n",
    "            (\"Person:Student\", \"_IS_MEMBER_OF_\", \"Class\"),\n",
    "            (\"Person:Student\", \"_ATTENDS_\", \"School\")\n",
    "        ],\n",
    "        key=[\"id\"],\n",
    "        required_properties=[\"id\", \"name\", \"dob\", \"grade\"],\n",
    "        unique_properties=[\"id\"]\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'{id : \"12534\", name : \"Jesse Jones\", dob : \"nan\", grade : \"9\", gps : \"3.2\", test : \"nan\"}'"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "person = Node(labels=[\"Person\", \"Student\"], \n",
    "              data_fields=[\"student_id\", \"student_name\", \"studen_dob\", \"student_grade\", \"student_gpa\"], \n",
    "              properties=dict(id=\"student_id\",\n",
    "                              name=\"student_name\",\n",
    "                              dob=\"student_dob\",\n",
    "                              grade=\"student_grade\",\n",
    "                              gps=\"student_gpa\",\n",
    "                              test=\"notthere\"\n",
    "                             ),\n",
    "             relationships=[\n",
    "                (\"Person:Student\", \"_IS_MEMBER_OF_\", \"Class\"),\n",
    "                (\"Person:Student\", \"_ATTENDS_\", \"School\")\n",
    "        ],\n",
    "             key=[\"id\"],\n",
    "             required_properties=[\"id\", \"name\", \"dob\", \"grade\"],\n",
    "             unique_properties=[\"id\"]\n",
    "             )\n",
    "person.load_properties_from_series(series=school_data.iloc[2])\n",
    "person.property_strings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'id': '1234',\n",
       " 'name': 'Matt Camp',\n",
       " 'dob': nan,\n",
       " 'grade': 12,\n",
       " 'gps': 3.8,\n",
       " 'test': nan}"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "props = person.properties\n",
    "pp = school_data.iloc[0].reindex(list(props.values()), axis=1)\n",
    "_props = dict()\n",
    "for k,v in zip(props.keys(), pp.items()):\n",
    "    _props[k] = v[1]\n",
    "    \n",
    "_props"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "student_id            1234\n",
       "student_name     Matt Camp\n",
       "student_dob            NaN\n",
       "student_grade           12\n",
       "student_gpa            3.8\n",
       "notthere               NaN\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['id'], ['id'], [], [], [], ['name', 'address']]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "unique_constraint_list = []\n",
    "for n in data_model:\n",
    "    cql_constraint = \"CREATE CONSTRAINT ON (book:Book) ASSERT book.isbn IS UNIQUE\"\n",
    "    unique_constraint_list.append(n[\"unique_properties\"])\n",
    "unique_constraint_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_to_make, relationships_to_make = create_nodes_and_relationships(dm, data_model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['id']"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes_to_make[15].unique_properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[MATCH (a:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"15.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"Algebra II\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"303.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"52\", name : \"Paul Billings\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"43.0\", name : \"Helen Billings\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"11.0\", subject : \"American History\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"423.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"49\", name : \"Gary Carell\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Ace Colbert\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}), (b:Class {grade : \"12.0\", subject : \"English\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"English\", employment_date : \"08/01/1999\", name : \"Marie Daily\"}), (b:Class {grade : \"12.0\", subject : \"English\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"3.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"English\", employment_date : \"08/01/1999\", name : \"Marie Daily\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"English\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"43.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Bob Jones\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"39.0\", name : \"Mary Jones\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"15.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"Algebra II\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"303.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"72\", name : \"Paul Camp\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"False\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"49.0\", name : \"Helen Camp\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"11.0\", subject : \"American History\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"423.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"49\", name : \"Gary Carell\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Ace Colbert\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relationships_to_make"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri = \"bolt://127.0.0.1:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"password\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session()\n",
    "for node in nodes_to_make:\n",
    "    session.run(node.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "for rel in relationships_to_make:\n",
    "    session.run(rel.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7",
   "language": "python",
   "name": "py3.7"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
