{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>class_grade</th>\n",
       "      <th>class_name</th>\n",
       "      <th>class_room_number</th>\n",
       "      <th>f_pickup</th>\n",
       "      <th>father_age</th>\n",
       "      <th>father_name</th>\n",
       "      <th>father_type</th>\n",
       "      <th>m_pickup</th>\n",
       "      <th>mother_age</th>\n",
       "      <th>mother_name</th>\n",
       "      <th>...</th>\n",
       "      <th>school_address</th>\n",
       "      <th>school_name</th>\n",
       "      <th>studen_dob</th>\n",
       "      <th>student_gpa</th>\n",
       "      <th>student_grade</th>\n",
       "      <th>student_name</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <th>teacher_name</th>\n",
       "      <th>years_teaching</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>303.0</td>\n",
       "      <td>False</td>\n",
       "      <td>72</td>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>49.0</td>\n",
       "      <td>Helen Camp</td>\n",
       "      <td>...</td>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>3.8</td>\n",
       "      <td>12</td>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>303.0</td>\n",
       "      <td>True</td>\n",
       "      <td>52</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Step</td>\n",
       "      <td>True</td>\n",
       "      <td>43.0</td>\n",
       "      <td>Helen Billings</td>\n",
       "      <td>...</td>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>3.7</td>\n",
       "      <td>12</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>12.0</td>\n",
       "      <td>English</td>\n",
       "      <td>43.0</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>39.0</td>\n",
       "      <td>Mary Jones</td>\n",
       "      <td>...</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>3.2</td>\n",
       "      <td>9</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>English</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>11.0</td>\n",
       "      <td>American History</td>\n",
       "      <td>423.0</td>\n",
       "      <td>True</td>\n",
       "      <td>49</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>History</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Ace Colbert</td>\n",
       "      <td>Step</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 21 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   class_grade        class_name  class_room_number  f_pickup  father_age  \\\n",
       "0         12.0        Algebra II              303.0     False          72   \n",
       "1         12.0        Algebra II              303.0      True          52   \n",
       "2         12.0           English               43.0      True          32   \n",
       "3         11.0  American History              423.0      True          49   \n",
       "4          NaN               NaN                NaN      True          32   \n",
       "\n",
       "     father_name father_type m_pickup  mother_age     mother_name  \\\n",
       "0      Paul Camp       Birth     True        49.0      Helen Camp   \n",
       "1  Paul Billings        Step     True        43.0  Helen Billings   \n",
       "2      Bob Jones       Birth     True        39.0      Mary Jones   \n",
       "3    Gary Carell       Birth      NaN         NaN             NaN   \n",
       "4    Ace Colbert        Step      NaN         NaN             NaN   \n",
       "\n",
       "       ...                                school_address  \\\n",
       "0      ...        1234 Harvard Way, Chattanooga TN 35761   \n",
       "1      ...        1234 Harvard Way, Chattanooga TN 35761   \n",
       "2      ...           1234 Jones Road, Nashville TN 35761   \n",
       "3      ...           1234 Jones Road, Nashville TN 35761   \n",
       "4      ...                                           NaN   \n",
       "\n",
       "                 school_name  studen_dob student_gpa  student_grade  \\\n",
       "0     Notre Dame High School  12/01/2001         3.8             12   \n",
       "1     Notre Dame High School   2/01/2001         3.7             12   \n",
       "2  Sudden Valley High School  12/01/2004         3.2              9   \n",
       "3  Sudden Valley High School  12/01/2003         2.9              9   \n",
       "4                        NaN  12/01/2003         2.9              9   \n",
       "\n",
       "    student_name teacher_degree teacher_employment_date   teacher_name  \\\n",
       "0      Matt Camp           Math              08/01/1998   Kathy Fisher   \n",
       "1  Matt Billings           Math              08/01/1998   Kathy Fisher   \n",
       "2    Jesse Jones        English              08/01/1999    Marie Daily   \n",
       "3    Billy Jones        History              08/01/1988  Kathy Freeley   \n",
       "4    Billy Jones            NaN                     NaN            NaN   \n",
       "\n",
       "  years_teaching  \n",
       "0           15.0  \n",
       "1           15.0  \n",
       "2            3.0  \n",
       "3            1.0  \n",
       "4            NaN  \n",
       "\n",
       "[5 rows x 21 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import datetime\n",
    "data_model = [\n",
    "    dict(\n",
    "        label=[\"Person\", \"Student\"],\n",
    "        data_fields=[\"student_name\", \"studen_dob\", \"student_grade\", \"student_gpa\"],\n",
    "        property_fields=[\"name\", \"dob\", \"grade\", \"class_grade\"],\n",
    "        relationships=[\n",
    "            (\"Person:Student\", \"_IS_MEMBER_OF_\", \"Class\"),\n",
    "            (\"Person:Student\", \"_ATTENDS_\", \"School\")\n",
    "        ],\n",
    "        node_key=[\"name\", \"dob\"],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Teacher\"],\n",
    "        data_fields=[\"teacher_name\", \"teacher_degree\", \"teacher_employment_date\"],\n",
    "        property_fields=[\"name\", \"degree\", \"employment_date\"],\n",
    "        relationships=[\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Class\", \n",
    "                dict(\n",
    "                    data_fields=[\"years_teaching\"],\n",
    "                    property_fields=[\"years_teaching\"]\n",
    "                )),\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Person:Student\")\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Class\"],\n",
    "        data_fields=[\"class_name\", \"class_grade\"],\n",
    "        property_fields=[\"subject\", \"grade\"],\n",
    "        relationships=[\n",
    "            (\n",
    "                \"Class\", \"_IS_AT_\", \"School\", \n",
    "                dict(\n",
    "                    data_fields=[\"class_room_number\"],\n",
    "                    property_fields=[\"room_number\"]\n",
    "                )\n",
    "            )\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Father\"],\n",
    "        data_fields=[\"father_name\", \"father_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Father\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"father_type\", \"f_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Mother\"],\n",
    "        data_fields=[\"mother_name\", \"mother_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Mother\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"mother_type\", \"m_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        node_key=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"School\"],\n",
    "        data_fields=[\"school_name\", \"school_address\"],\n",
    "        property_fields=[\"name\", \"address\"],\n",
    "        relationships=[\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    )\n",
    "]\n",
    "\n",
    "school_data = pd.DataFrame([\n",
    "    {\n",
    "        \"student_name\": \"Matt Camp\", \"studen_dob\": \"12/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.8,\n",
    "        \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Camp\", \"father_age\": 72,\n",
    "        \"mother_name\": \"Helen Camp\", \"mother_age\": 49,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": False,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Matt Billings\", \"studen_dob\": \"2/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.7,\n",
    "        \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Billings\", \"father_age\": 52,\n",
    "        \"mother_name\": \"Helen Billings\", \"mother_age\": 43,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Jesse Jones\", \"studen_dob\": \"12/01/2004\", \"student_grade\": 9, \"student_gpa\": 3.2,\n",
    "        \"teacher_name\": \"Marie Daily\", \"teacher_degree\": \"English\", \"teacher_employment_date\": \"08/01/1999\",\n",
    "        \"class_name\": \"English\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Bob Jones\", \"father_age\": 32,\n",
    "        \"mother_name\": \"Mary Jones\", \"mother_age\": 39,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 43,\n",
    "        \"years_teaching\": 3,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"teacher_name\": \"Kathy Freeley\", \"teacher_degree\": \"History\", \"teacher_employment_date\": \"08/01/1988\",\n",
    "        \"class_name\": \"American History\", \"class_grade\": 11,\n",
    "        \"father_name\": \"Gary Carell\", \"father_age\": 49,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 423,\n",
    "        \"years_teaching\": 1,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"father_name\": \"Ace Colbert\", \"father_age\": 32,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True\n",
    "    }\n",
    "\n",
    "])\n",
    "school_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/mcamp/anaconda3/envs/py3.7/lib/python3.7/site-packages/pandas/core/indexing.py:1472: FutureWarning: \n",
      "Passing list-likes to .loc or [] with any missing label will raise\n",
      "KeyError in the future, you can use .reindex() as an alternative.\n",
      "\n",
      "See the documentation here:\n",
      "https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike\n",
      "  return self._getitem_tuple(key)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr:last-of-type th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>pk</th>\n",
       "      <th>Matt Camp</th>\n",
       "      <th>Matt Billings</th>\n",
       "      <th>Jesse Jones</th>\n",
       "      <th colspan=\"2\" halign=\"left\">Billy Jones</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>node</th>\n",
       "      <th>property</th>\n",
       "      <th>data_field</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">School</th>\n",
       "      <th>address</th>\n",
       "      <th>school_address</th>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>school_name</th>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Person:Teacher</th>\n",
       "      <th>name</th>\n",
       "      <th>teacher_name</th>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>employment_date</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>degree</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <td>Math</td>\n",
       "      <td>Math</td>\n",
       "      <td>English</td>\n",
       "      <td>History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"4\" valign=\"top\">Person:Student</th>\n",
       "      <th>grade</th>\n",
       "      <th>student_grade</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>student_name</th>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>dob</th>\n",
       "      <th>studen_dob</th>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>12/01/2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>class_grade</th>\n",
       "      <th>student_gpa</th>\n",
       "      <td>3.8</td>\n",
       "      <td>3.7</td>\n",
       "      <td>3.2</td>\n",
       "      <td>2.9</td>\n",
       "      <td>2.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Mother</th>\n",
       "      <th>age</th>\n",
       "      <th>mother_age</th>\n",
       "      <td>49</td>\n",
       "      <td>43</td>\n",
       "      <td>39</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>mother_name</th>\n",
       "      <td>Helen Camp</td>\n",
       "      <td>Helen Billings</td>\n",
       "      <td>Mary Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Father</th>\n",
       "      <th>age</th>\n",
       "      <th>father_age</th>\n",
       "      <td>72</td>\n",
       "      <td>52</td>\n",
       "      <td>32</td>\n",
       "      <td>49</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>father_name</th>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Ace Colbert</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Class</th>\n",
       "      <th>grade</th>\n",
       "      <th>class_grade</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>11</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>subject</th>\n",
       "      <th>class_name</th>\n",
       "      <td>Algebra II</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>English</td>\n",
       "      <td>American History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Person:Teacher', '_TEACHES_', 'Class')</th>\n",
       "      <th>years_teaching</th>\n",
       "      <th>years_teaching</th>\n",
       "      <td>15</td>\n",
       "      <td>15</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Mother', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>pickup</th>\n",
       "      <th>m_pickup</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>parent_type</th>\n",
       "      <th>mother_type</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Father', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>parent_type</th>\n",
       "      <th>father_type</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>pickup</th>\n",
       "      <th>f_pickup</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Class', '_IS_AT_', 'School')</th>\n",
       "      <th>room_number</th>\n",
       "      <th>class_room_number</th>\n",
       "      <td>303</td>\n",
       "      <td>303</td>\n",
       "      <td>43</td>\n",
       "      <td>423</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "pk                                                                                                                       Matt Camp  \\\n",
       "index                                                                                                                            0   \n",
       "node                                               property        data_field                                                        \n",
       "School                                             address         school_address           1234 Harvard Way, Chattanooga TN 35761   \n",
       "                                                   name            school_name                              Notre Dame High School   \n",
       "Person:Teacher                                     name            teacher_name                                       Kathy Fisher   \n",
       "                                                   employment_date teacher_employment_date                              08/01/1998   \n",
       "                                                   degree          teacher_degree                                             Math   \n",
       "Person:Student                                     grade           student_grade                                                12   \n",
       "                                                   name            student_name                                          Matt Camp   \n",
       "                                                   dob             studen_dob                                           12/01/2001   \n",
       "                                                   class_grade     student_gpa                                                 3.8   \n",
       "Person:Parent:Mother                               age             mother_age                                                   49   \n",
       "                                                   name            mother_name                                          Helen Camp   \n",
       "Person:Parent:Father                               age             father_age                                                   72   \n",
       "                                                   name            father_name                                           Paul Camp   \n",
       "Class                                              grade           class_grade                                                  12   \n",
       "                                                   subject         class_name                                           Algebra II   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               15   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                   True   \n",
       "                                                   parent_type     mother_type                                               Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                               Birth   \n",
       "                                                   pickup          f_pickup                                                  False   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                           303   \n",
       "\n",
       "pk                                                                                                                   Matt Billings  \\\n",
       "index                                                                                                                            1   \n",
       "node                                               property        data_field                                                        \n",
       "School                                             address         school_address           1234 Harvard Way, Chattanooga TN 35761   \n",
       "                                                   name            school_name                              Notre Dame High School   \n",
       "Person:Teacher                                     name            teacher_name                                       Kathy Fisher   \n",
       "                                                   employment_date teacher_employment_date                              08/01/1998   \n",
       "                                                   degree          teacher_degree                                             Math   \n",
       "Person:Student                                     grade           student_grade                                                12   \n",
       "                                                   name            student_name                                      Matt Billings   \n",
       "                                                   dob             studen_dob                                            2/01/2001   \n",
       "                                                   class_grade     student_gpa                                                 3.7   \n",
       "Person:Parent:Mother                               age             mother_age                                                   43   \n",
       "                                                   name            mother_name                                      Helen Billings   \n",
       "Person:Parent:Father                               age             father_age                                                   52   \n",
       "                                                   name            father_name                                       Paul Billings   \n",
       "Class                                              grade           class_grade                                                  12   \n",
       "                                                   subject         class_name                                           Algebra II   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               15   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                   True   \n",
       "                                                   parent_type     mother_type                                               Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                                Step   \n",
       "                                                   pickup          f_pickup                                                   True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                           303   \n",
       "\n",
       "pk                                                                                                                  Jesse Jones  \\\n",
       "index                                                                                                                         2   \n",
       "node                                               property        data_field                                                     \n",
       "School                                             address         school_address           1234 Jones Road, Nashville TN 35761   \n",
       "                                                   name            school_name                        Sudden Valley High School   \n",
       "Person:Teacher                                     name            teacher_name                                     Marie Daily   \n",
       "                                                   employment_date teacher_employment_date                           08/01/1999   \n",
       "                                                   degree          teacher_degree                                       English   \n",
       "Person:Student                                     grade           student_grade                                              9   \n",
       "                                                   name            student_name                                     Jesse Jones   \n",
       "                                                   dob             studen_dob                                        12/01/2004   \n",
       "                                                   class_grade     student_gpa                                              3.2   \n",
       "Person:Parent:Mother                               age             mother_age                                                39   \n",
       "                                                   name            mother_name                                       Mary Jones   \n",
       "Person:Parent:Father                               age             father_age                                                32   \n",
       "                                                   name            father_name                                        Bob Jones   \n",
       "Class                                              grade           class_grade                                               12   \n",
       "                                                   subject         class_name                                           English   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             3   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                True   \n",
       "                                                   parent_type     mother_type                                            Birth   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                            Birth   \n",
       "                                                   pickup          f_pickup                                                True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                         43   \n",
       "\n",
       "pk                                                                                                                  Billy Jones  \\\n",
       "index                                                                                                                         3   \n",
       "node                                               property        data_field                                                     \n",
       "School                                             address         school_address           1234 Jones Road, Nashville TN 35761   \n",
       "                                                   name            school_name                        Sudden Valley High School   \n",
       "Person:Teacher                                     name            teacher_name                                   Kathy Freeley   \n",
       "                                                   employment_date teacher_employment_date                           08/01/1988   \n",
       "                                                   degree          teacher_degree                                       History   \n",
       "Person:Student                                     grade           student_grade                                              9   \n",
       "                                                   name            student_name                                     Billy Jones   \n",
       "                                                   dob             studen_dob                                        12/01/2003   \n",
       "                                                   class_grade     student_gpa                                              2.9   \n",
       "Person:Parent:Mother                               age             mother_age                                               NaN   \n",
       "                                                   name            mother_name                                              NaN   \n",
       "Person:Parent:Father                               age             father_age                                                49   \n",
       "                                                   name            father_name                                      Gary Carell   \n",
       "Class                                              grade           class_grade                                               11   \n",
       "                                                   subject         class_name                                  American History   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             1   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                                                 NaN   \n",
       "                                                   parent_type     mother_type                                              NaN   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                            Birth   \n",
       "                                                   pickup          f_pickup                                                True   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                        423   \n",
       "\n",
       "pk                                                                                                       \n",
       "index                                                                                                 4  \n",
       "node                                               property        data_field                            \n",
       "School                                             address         school_address                   NaN  \n",
       "                                                   name            school_name                      NaN  \n",
       "Person:Teacher                                     name            teacher_name                     NaN  \n",
       "                                                   employment_date teacher_employment_date          NaN  \n",
       "                                                   degree          teacher_degree                   NaN  \n",
       "Person:Student                                     grade           student_grade                      9  \n",
       "                                                   name            student_name             Billy Jones  \n",
       "                                                   dob             studen_dob                12/01/2003  \n",
       "                                                   class_grade     student_gpa                      2.9  \n",
       "Person:Parent:Mother                               age             mother_age                       NaN  \n",
       "                                                   name            mother_name                      NaN  \n",
       "Person:Parent:Father                               age             father_age                        32  \n",
       "                                                   name            father_name              Ace Colbert  \n",
       "Class                                              grade           class_grade                      NaN  \n",
       "                                                   subject         class_name                       NaN  \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                   NaN  \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... pickup          m_pickup                         NaN  \n",
       "                                                   parent_type     mother_type                      NaN  \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                     Step  \n",
       "                                                   pickup          f_pickup                        True  \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                NaN  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from SevenBridges import *\n",
    "dm = apply_data_model(school_data, data_model, \"student_name\")\n",
    "dm.T.sort_values([('node')], ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_to_make, relationships_to_make = create_nodes_and_relationships(dm, data_model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(n:Class {grade : \"11.0\", subject : \"American History\"}),\n",
       " (n:Class {grade : \"12.0\", subject : \"Algebra II\"}),\n",
       " (n:Class {grade : \"12.0\", subject : \"Algebra II\"}),\n",
       " (n:Class {grade : \"12.0\", subject : \"English\"}),\n",
       " (n:Person:Parent:Father {age : \"49\", name : \"Gary Carell\"}),\n",
       " (n:Person:Parent:Father {age : \"72\", name : \"Paul Camp\"}),\n",
       " (n:Person:Parent:Father {age : \"52\", name : \"Paul Billings\"}),\n",
       " (n:Person:Parent:Father {age : \"32\", name : \"Ace Colbert\"}),\n",
       " (n:Person:Parent:Father {age : \"32\", name : \"Bob Jones\"}),\n",
       " (n:Person:Parent:Mother {age : \"49.0\", name : \"Helen Camp\"}),\n",
       " (n:Person:Parent:Mother {age : \"43.0\", name : \"Helen Billings\"}),\n",
       " (n:Person:Parent:Mother {age : \"39.0\", name : \"Mary Jones\"}),\n",
       " (n:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}),\n",
       " (n:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}),\n",
       " (n:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}),\n",
       " (n:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}),\n",
       " (n:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}),\n",
       " (n:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}),\n",
       " (n:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}),\n",
       " (n:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}),\n",
       " (n:Person:Teacher {degree : \"English\", employment_date : \"08/01/1999\", name : \"Marie Daily\"}),\n",
       " (n:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}),\n",
       " (n:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}),\n",
       " (n:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}),\n",
       " (n:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"})]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes_to_make"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"11.0\", subject : \"American History\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"423.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"49\", name : \"Gary Carell\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Ace Colbert\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"15.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"Algebra II\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"303.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"72\", name : \"Paul Camp\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"False\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"49.0\", name : \"Helen Camp\"}), (b:Person:Student {dob : \"12/01/2001\", class_grade : \"3.8\", grade : \"12\", name : \"Matt Camp\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Class {grade : \"12.0\", subject : \"Algebra II\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"15.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"Math\", employment_date : \"08/01/1998\", name : \"Kathy Fisher\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"Algebra II\"}), (b:School {address : \"1234 Harvard Way, Chattanooga TN 35761\", name : \"Notre Dame High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"303.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"52\", name : \"Paul Billings\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"43.0\", name : \"Helen Billings\"}), (b:Person:Student {dob : \"2/01/2001\", class_grade : \"3.7\", grade : \"12\", name : \"Matt Billings\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Class {grade : \"11.0\", subject : \"American History\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"History\", employment_date : \"08/01/1988\", name : \"Kathy Freeley\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"11.0\", subject : \"American History\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"423.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"49\", name : \"Gary Carell\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Ace Colbert\"}), (b:Person:Student {dob : \"12/01/2003\", class_grade : \"2.9\", grade : \"9\", name : \"Billy Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Step\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}), (b:Class {grade : \"12.0\", subject : \"English\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"English\", employment_date : \"08/01/1999\", name : \"Marie Daily\"}), (b:Class {grade : \"12.0\", subject : \"English\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"3.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {degree : \"English\", employment_date : \"08/01/1999\", name : \"Marie Daily\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {grade : \"12.0\", subject : \"English\"}), (b:School {address : \"1234 Jones Road, Nashville TN 35761\", name : \"Sudden Valley High School\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"43.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {age : \"32\", name : \"Bob Jones\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {age : \"39.0\", name : \"Mary Jones\"}), (b:Person:Student {dob : \"12/01/2004\", class_grade : \"3.2\", grade : \"9\", name : \"Jesse Jones\"}) MERGE (a)-[r:_PARENT_OF_ {pickup : \"True\", parent_type : \"Birth\"}]->(b) RETURN r]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relationships_to_make"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri = \"bolt://127.0.0.1:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"password\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session()\n",
    "for node in nodes_to_make:\n",
    "    session.run(node.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "for rel in relationships_to_make:\n",
    "    session.run(rel.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7",
   "language": "python",
   "name": "py3.7"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
