{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>class_grade</th>\n",
       "      <th>class_name</th>\n",
       "      <th>class_room_number</th>\n",
       "      <th>f_pickup</th>\n",
       "      <th>father_age</th>\n",
       "      <th>father_name</th>\n",
       "      <th>father_type</th>\n",
       "      <th>m_pickup</th>\n",
       "      <th>mother_age</th>\n",
       "      <th>mother_name</th>\n",
       "      <th>...</th>\n",
       "      <th>school_name</th>\n",
       "      <th>studen_dob</th>\n",
       "      <th>student_gpa</th>\n",
       "      <th>student_grade</th>\n",
       "      <th>student_name</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <th>teacher_name</th>\n",
       "      <th>years_teaching</th>\n",
       "      <th>zZNotUsedData</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>303.0</td>\n",
       "      <td>False</td>\n",
       "      <td>72</td>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>49.0</td>\n",
       "      <td>Helen Camp</td>\n",
       "      <td>...</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>3.8</td>\n",
       "      <td>12</td>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "      <td>Test</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>12.0</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>303.0</td>\n",
       "      <td>True</td>\n",
       "      <td>52</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Step</td>\n",
       "      <td>True</td>\n",
       "      <td>43.0</td>\n",
       "      <td>Helen Billings</td>\n",
       "      <td>...</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>3.7</td>\n",
       "      <td>12</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Math</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>15.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>12.0</td>\n",
       "      <td>English</td>\n",
       "      <td>43.0</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Birth</td>\n",
       "      <td>True</td>\n",
       "      <td>39.0</td>\n",
       "      <td>Mary Jones</td>\n",
       "      <td>...</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>3.2</td>\n",
       "      <td>9</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>English</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>3.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>11.0</td>\n",
       "      <td>American History</td>\n",
       "      <td>423.0</td>\n",
       "      <td>True</td>\n",
       "      <td>49</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>History</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>1.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "      <td>Ace Colbert</td>\n",
       "      <td>Step</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>2.9</td>\n",
       "      <td>9</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 22 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   class_grade        class_name  class_room_number  f_pickup  father_age  \\\n",
       "0         12.0        Algebra II              303.0     False          72   \n",
       "1         12.0        Algebra II              303.0      True          52   \n",
       "2         12.0           English               43.0      True          32   \n",
       "3         11.0  American History              423.0      True          49   \n",
       "4          NaN               NaN                NaN      True          32   \n",
       "\n",
       "     father_name father_type m_pickup  mother_age     mother_name  \\\n",
       "0      Paul Camp       Birth     True        49.0      Helen Camp   \n",
       "1  Paul Billings        Step     True        43.0  Helen Billings   \n",
       "2      Bob Jones       Birth     True        39.0      Mary Jones   \n",
       "3    Gary Carell       Birth      NaN         NaN             NaN   \n",
       "4    Ace Colbert        Step      NaN         NaN             NaN   \n",
       "\n",
       "       ...                     school_name  studen_dob student_gpa  \\\n",
       "0      ...          Notre Dame High School  12/01/2001         3.8   \n",
       "1      ...          Notre Dame High School   2/01/2001         3.7   \n",
       "2      ...       Sudden Valley High School  12/01/2004         3.2   \n",
       "3      ...       Sudden Valley High School  12/01/2003         2.9   \n",
       "4      ...                             NaN  12/01/2003         2.9   \n",
       "\n",
       "  student_grade   student_name  teacher_degree teacher_employment_date  \\\n",
       "0            12      Matt Camp            Math              08/01/1998   \n",
       "1            12  Matt Billings            Math              08/01/1998   \n",
       "2             9    Jesse Jones         English              08/01/1999   \n",
       "3             9    Billy Jones         History              08/01/1988   \n",
       "4             9    Billy Jones             NaN                     NaN   \n",
       "\n",
       "    teacher_name years_teaching zZNotUsedData  \n",
       "0   Kathy Fisher           15.0          Test  \n",
       "1   Kathy Fisher           15.0           NaN  \n",
       "2    Marie Daily            3.0           NaN  \n",
       "3  Kathy Freeley            1.0           NaN  \n",
       "4            NaN            NaN           NaN  \n",
       "\n",
       "[5 rows x 22 columns]"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import datetime\n",
    "import pandas as pd\n",
    "\n",
    "data_model = [\n",
    "    dict(\n",
    "        label=[\"Person\", \"Student\"],\n",
    "        data_fields=[\"student_name\", \"studen_dob\", \"student_grade\", \"student_gpa\"],\n",
    "        property_fields=[\"name\", \"dob\", \"grade\", \"class_grade\"],\n",
    "        relationships=[\n",
    "            (\"Person:Student\", \"_IS_MEMBER_OF_\", \"Class\"),\n",
    "            (\"Person:Student\", \"_ATTENDS_\", \"School\")\n",
    "        ],\n",
    "        node_key=[\"name\", \"dob\"],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Teacher\"],\n",
    "        data_fields=[\"teacher_name\", \"teacher_degree\", \"teacher_employment_date\"],\n",
    "        property_fields=[\"name\", \"degree\", \"employment_date\"],\n",
    "        relationships=[\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Class\", \n",
    "                dict(\n",
    "                    data_fields=[\"years_teaching\"],\n",
    "                    property_fields=[\"years_teaching\"]\n",
    "                )),\n",
    "            (\"Person:Teacher\", \"_TEACHES_\", \"Person:Student\")\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Class\"],\n",
    "        data_fields=[\"class_name\", \"class_grade\"],\n",
    "        property_fields=[\"subject\", \"grade\"],\n",
    "        relationships=[\n",
    "            (\n",
    "                \"Class\", \"_IS_AT_\", \"School\", \n",
    "                dict(\n",
    "                    data_fields=[\"class_room_number\"],\n",
    "                    property_fields=[\"room_number\"]\n",
    "                )\n",
    "            )\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Father\"],\n",
    "        data_fields=[\"father_name\", \"father_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Father\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"father_type\", \"f_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"Person\", \"Parent\", \"Mother\"],\n",
    "        data_fields=[\"mother_name\", \"mother_age\"],\n",
    "        property_fields=[\"name\", \"age\"],\n",
    "        relationships=[\n",
    "            (\"Person:Parent:Mother\", \"_PARENT_OF_\", \"Person:Student\", \n",
    "                dict(\n",
    "                    data_fields=[\"mother_type\", \"m_pickup\"],\n",
    "                    property_fields=[\"parent_type\", \"pickup\"]\n",
    "                ))\n",
    "        ],\n",
    "        node_key=[]\n",
    "    ),\n",
    "    dict(\n",
    "        label=[\"School\"],\n",
    "        data_fields=[\"school_name\", \"school_address\"],\n",
    "        property_fields=[\"name\", \"address\"],\n",
    "        relationships=[\n",
    "        ],\n",
    "        node_key=[],\n",
    "        required_properties=[]\n",
    "    )\n",
    "]\n",
    "\n",
    "school_data = pd.DataFrame([\n",
    "    {\n",
    "        \"student_name\": \"Matt Camp\", \"studen_dob\": \"12/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.8,\n",
    "        \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Camp\", \"father_age\": 72,\n",
    "        \"mother_name\": \"Helen Camp\", \"mother_age\": 49,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": False,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True,\n",
    "        \"zZNotUsedData\": \"Test\"\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Matt Billings\", \"studen_dob\": \"2/01/2001\", \"student_grade\": 12, \"student_gpa\": 3.7,\n",
    "        \"teacher_name\": \"Kathy Fisher\", \"teacher_degree\": \"Math\", \"teacher_employment_date\": \"08/01/1998\",\n",
    "        \"class_name\": \"Algebra II\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Paul Billings\", \"father_age\": 52,\n",
    "        \"mother_name\": \"Helen Billings\", \"mother_age\": 43,\n",
    "        \"school_name\": \"Notre Dame High School\", \"school_address\": \"1234 Harvard Way, Chattanooga TN 35761\",\n",
    "        \"class_room_number\": 303,\n",
    "        \"years_teaching\": 15,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Jesse Jones\", \"studen_dob\": \"12/01/2004\", \"student_grade\": 9, \"student_gpa\": 3.2,\n",
    "        \"teacher_name\": \"Marie Daily\", \"teacher_degree\": \"English\", \"teacher_employment_date\": \"08/01/1999\",\n",
    "        \"class_name\": \"English\", \"class_grade\": 12,\n",
    "        \"father_name\": \"Bob Jones\", \"father_age\": 32,\n",
    "        \"mother_name\": \"Mary Jones\", \"mother_age\": 39,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 43,\n",
    "        \"years_teaching\": 3,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True,\n",
    "        \"mother_type\": \"Birth\", \"m_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"teacher_name\": \"Kathy Freeley\", \"teacher_degree\": \"History\", \"teacher_employment_date\": \"08/01/1988\",\n",
    "        \"class_name\": \"American History\", \"class_grade\": 11,\n",
    "        \"father_name\": \"Gary Carell\", \"father_age\": 49,\n",
    "        \"school_name\": \"Sudden Valley High School\", \"school_address\": \"1234 Jones Road, Nashville TN 35761\",\n",
    "        \"class_room_number\": 423,\n",
    "        \"years_teaching\": 1,\n",
    "        \"father_type\": \"Birth\", \"f_pickup\": True\n",
    "    },\n",
    "    {\n",
    "        \"student_name\": \"Billy Jones\", \"studen_dob\": \"12/01/2003\", \"student_grade\": 9, \"student_gpa\": 2.9,\n",
    "        \"father_name\": \"Ace Colbert\", \"father_age\": 32,\n",
    "        \"father_type\": \"Step\", \"f_pickup\": True\n",
    "    }\n",
    "\n",
    "])\n",
    "school_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/mcamp/anaconda3/envs/py3.7/lib/python3.7/site-packages/pandas/core/indexing.py:1472: FutureWarning: \n",
      "Passing list-likes to .loc or [] with any missing label will raise\n",
      "KeyError in the future, you can use .reindex() as an alternative.\n",
      "\n",
      "See the documentation here:\n",
      "https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike\n",
      "  return self._getitem_tuple(key)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr:last-of-type th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>pk</th>\n",
       "      <th>Matt Camp</th>\n",
       "      <th>Matt Billings</th>\n",
       "      <th>Jesse Jones</th>\n",
       "      <th colspan=\"2\" halign=\"left\">Billy Jones</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>node</th>\n",
       "      <th>property</th>\n",
       "      <th>data_field</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>UnusedFields</th>\n",
       "      <th>ignored</th>\n",
       "      <th>zZNotUsedData</th>\n",
       "      <td>Test</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">School</th>\n",
       "      <th>address</th>\n",
       "      <th>school_address</th>\n",
       "      <td>3.8</td>\n",
       "      <td>3.7</td>\n",
       "      <td>3.2</td>\n",
       "      <td>2.9</td>\n",
       "      <td>2.9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>school_name</th>\n",
       "      <td>12/01/2001</td>\n",
       "      <td>2/01/2001</td>\n",
       "      <td>12/01/2004</td>\n",
       "      <td>12/01/2003</td>\n",
       "      <td>12/01/2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Person:Teacher</th>\n",
       "      <th>name</th>\n",
       "      <th>teacher_name</th>\n",
       "      <td>72</td>\n",
       "      <td>52</td>\n",
       "      <td>32</td>\n",
       "      <td>49</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>degree</th>\n",
       "      <th>teacher_degree</th>\n",
       "      <td>Paul Camp</td>\n",
       "      <td>Paul Billings</td>\n",
       "      <td>Bob Jones</td>\n",
       "      <td>Gary Carell</td>\n",
       "      <td>Ace Colbert</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>employment_date</th>\n",
       "      <th>teacher_employment_date</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Step</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"4\" valign=\"top\">Person:Student</th>\n",
       "      <th>dob</th>\n",
       "      <th>studen_dob</th>\n",
       "      <td>Algebra II</td>\n",
       "      <td>Algebra II</td>\n",
       "      <td>English</td>\n",
       "      <td>American History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>student_name</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>11</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>class_grade</th>\n",
       "      <th>student_gpa</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>grade</th>\n",
       "      <th>student_grade</th>\n",
       "      <td>303</td>\n",
       "      <td>303</td>\n",
       "      <td>43</td>\n",
       "      <td>423</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Mother</th>\n",
       "      <th>age</th>\n",
       "      <th>mother_age</th>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Notre Dame High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>Sudden Valley High School</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>name</th>\n",
       "      <th>mother_name</th>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Harvard Way, Chattanooga TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>1234 Jones Road, Nashville TN 35761</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Person:Parent:Father</th>\n",
       "      <th>name</th>\n",
       "      <th>father_name</th>\n",
       "      <td>Helen Camp</td>\n",
       "      <td>Helen Billings</td>\n",
       "      <td>Mary Jones</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>age</th>\n",
       "      <th>father_age</th>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>Birth</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Class</th>\n",
       "      <th>grade</th>\n",
       "      <th>class_grade</th>\n",
       "      <td>49</td>\n",
       "      <td>43</td>\n",
       "      <td>39</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>subject</th>\n",
       "      <th>class_name</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Person:Teacher', '_TEACHES_', 'Class')</th>\n",
       "      <th>years_teaching</th>\n",
       "      <th>years_teaching</th>\n",
       "      <td>12</td>\n",
       "      <td>12</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Mother', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>parent_type</th>\n",
       "      <th>mother_type</th>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Kathy Fisher</td>\n",
       "      <td>Marie Daily</td>\n",
       "      <td>Kathy Freeley</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>pickup</th>\n",
       "      <th>m_pickup</th>\n",
       "      <td>15</td>\n",
       "      <td>15</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">('Person:Parent:Father', '_PARENT_OF_', 'Person:Student')</th>\n",
       "      <th>parent_type</th>\n",
       "      <th>father_type</th>\n",
       "      <td>Math</td>\n",
       "      <td>Math</td>\n",
       "      <td>English</td>\n",
       "      <td>History</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>pickup</th>\n",
       "      <th>f_pickup</th>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1998</td>\n",
       "      <td>08/01/1999</td>\n",
       "      <td>08/01/1988</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>('Class', '_IS_AT_', 'School')</th>\n",
       "      <th>room_number</th>\n",
       "      <th>class_room_number</th>\n",
       "      <td>Matt Camp</td>\n",
       "      <td>Matt Billings</td>\n",
       "      <td>Jesse Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "      <td>Billy Jones</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "pk                                                                                                                       Matt Camp  \\\n",
       "index                                                                                                                            0   \n",
       "node                                               property        data_field                                                        \n",
       "UnusedFields                                       ignored         zZNotUsedData                                              Test   \n",
       "School                                             address         school_address                                              3.8   \n",
       "                                                   name            school_name                                          12/01/2001   \n",
       "Person:Teacher                                     name            teacher_name                                                 72   \n",
       "                                                   degree          teacher_degree                                        Paul Camp   \n",
       "                                                   employment_date teacher_employment_date                                   Birth   \n",
       "Person:Student                                     dob             studen_dob                                           Algebra II   \n",
       "                                                   name            student_name                                                 12   \n",
       "                                                   class_grade     student_gpa                                               False   \n",
       "                                                   grade           student_grade                                               303   \n",
       "Person:Parent:Mother                               age             mother_age                               Notre Dame High School   \n",
       "                                                   name            mother_name              1234 Harvard Way, Chattanooga TN 35761   \n",
       "Person:Parent:Father                               name            father_name                                          Helen Camp   \n",
       "                                                   age             father_age                                                Birth   \n",
       "Class                                              grade           class_grade                                                  49   \n",
       "                                                   subject         class_name                                                 True   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               12   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... parent_type     mother_type                                        Kathy Fisher   \n",
       "                                                   pickup          m_pickup                                                     15   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                                Math   \n",
       "                                                   pickup          f_pickup                                             08/01/1998   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                     Matt Camp   \n",
       "\n",
       "pk                                                                                                                   Matt Billings  \\\n",
       "index                                                                                                                            1   \n",
       "node                                               property        data_field                                                        \n",
       "UnusedFields                                       ignored         zZNotUsedData                                               NaN   \n",
       "School                                             address         school_address                                              3.7   \n",
       "                                                   name            school_name                                           2/01/2001   \n",
       "Person:Teacher                                     name            teacher_name                                                 52   \n",
       "                                                   degree          teacher_degree                                    Paul Billings   \n",
       "                                                   employment_date teacher_employment_date                                    Step   \n",
       "Person:Student                                     dob             studen_dob                                           Algebra II   \n",
       "                                                   name            student_name                                                 12   \n",
       "                                                   class_grade     student_gpa                                                True   \n",
       "                                                   grade           student_grade                                               303   \n",
       "Person:Parent:Mother                               age             mother_age                               Notre Dame High School   \n",
       "                                                   name            mother_name              1234 Harvard Way, Chattanooga TN 35761   \n",
       "Person:Parent:Father                               name            father_name                                      Helen Billings   \n",
       "                                                   age             father_age                                                Birth   \n",
       "Class                                              grade           class_grade                                                  43   \n",
       "                                                   subject         class_name                                                 True   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                               12   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... parent_type     mother_type                                        Kathy Fisher   \n",
       "                                                   pickup          m_pickup                                                     15   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                                Math   \n",
       "                                                   pickup          f_pickup                                             08/01/1998   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                 Matt Billings   \n",
       "\n",
       "pk                                                                                                                  Jesse Jones  \\\n",
       "index                                                                                                                         2   \n",
       "node                                               property        data_field                                                     \n",
       "UnusedFields                                       ignored         zZNotUsedData                                            NaN   \n",
       "School                                             address         school_address                                           3.2   \n",
       "                                                   name            school_name                                       12/01/2004   \n",
       "Person:Teacher                                     name            teacher_name                                              32   \n",
       "                                                   degree          teacher_degree                                     Bob Jones   \n",
       "                                                   employment_date teacher_employment_date                                Birth   \n",
       "Person:Student                                     dob             studen_dob                                           English   \n",
       "                                                   name            student_name                                              12   \n",
       "                                                   class_grade     student_gpa                                             True   \n",
       "                                                   grade           student_grade                                             43   \n",
       "Person:Parent:Mother                               age             mother_age                         Sudden Valley High School   \n",
       "                                                   name            mother_name              1234 Jones Road, Nashville TN 35761   \n",
       "Person:Parent:Father                               name            father_name                                       Mary Jones   \n",
       "                                                   age             father_age                                             Birth   \n",
       "Class                                              grade           class_grade                                               39   \n",
       "                                                   subject         class_name                                              True   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             9   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... parent_type     mother_type                                      Marie Daily   \n",
       "                                                   pickup          m_pickup                                                   3   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                          English   \n",
       "                                                   pickup          f_pickup                                          08/01/1999   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                Jesse Jones   \n",
       "\n",
       "pk                                                                                                                  Billy Jones  \\\n",
       "index                                                                                                                         3   \n",
       "node                                               property        data_field                                                     \n",
       "UnusedFields                                       ignored         zZNotUsedData                                            NaN   \n",
       "School                                             address         school_address                                           2.9   \n",
       "                                                   name            school_name                                       12/01/2003   \n",
       "Person:Teacher                                     name            teacher_name                                              49   \n",
       "                                                   degree          teacher_degree                                   Gary Carell   \n",
       "                                                   employment_date teacher_employment_date                                Birth   \n",
       "Person:Student                                     dob             studen_dob                                  American History   \n",
       "                                                   name            student_name                                              11   \n",
       "                                                   class_grade     student_gpa                                             True   \n",
       "                                                   grade           student_grade                                            423   \n",
       "Person:Parent:Mother                               age             mother_age                         Sudden Valley High School   \n",
       "                                                   name            mother_name              1234 Jones Road, Nashville TN 35761   \n",
       "Person:Parent:Father                               name            father_name                                              NaN   \n",
       "                                                   age             father_age                                               NaN   \n",
       "Class                                              grade           class_grade                                              NaN   \n",
       "                                                   subject         class_name                                               NaN   \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                                             9   \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... parent_type     mother_type                                    Kathy Freeley   \n",
       "                                                   pickup          m_pickup                                                   1   \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                                          History   \n",
       "                                                   pickup          f_pickup                                          08/01/1988   \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number                                Billy Jones   \n",
       "\n",
       "pk                                                                                                       \n",
       "index                                                                                                 4  \n",
       "node                                               property        data_field                            \n",
       "UnusedFields                                       ignored         zZNotUsedData                    NaN  \n",
       "School                                             address         school_address                   2.9  \n",
       "                                                   name            school_name               12/01/2003  \n",
       "Person:Teacher                                     name            teacher_name                      32  \n",
       "                                                   degree          teacher_degree           Ace Colbert  \n",
       "                                                   employment_date teacher_employment_date         Step  \n",
       "Person:Student                                     dob             studen_dob                       NaN  \n",
       "                                                   name            student_name                     NaN  \n",
       "                                                   class_grade     student_gpa                     True  \n",
       "                                                   grade           student_grade                    NaN  \n",
       "Person:Parent:Mother                               age             mother_age                       NaN  \n",
       "                                                   name            mother_name                      NaN  \n",
       "Person:Parent:Father                               name            father_name                      NaN  \n",
       "                                                   age             father_age                       NaN  \n",
       "Class                                              grade           class_grade                      NaN  \n",
       "                                                   subject         class_name                       NaN  \n",
       "('Person:Teacher', '_TEACHES_', 'Class')           years_teaching  years_teaching                     9  \n",
       "('Person:Parent:Mother', '_PARENT_OF_', 'Person... parent_type     mother_type                      NaN  \n",
       "                                                   pickup          m_pickup                         NaN  \n",
       "('Person:Parent:Father', '_PARENT_OF_', 'Person... parent_type     father_type                      NaN  \n",
       "                                                   pickup          f_pickup                         NaN  \n",
       "('Class', '_IS_AT_', 'School')                     room_number     class_room_number        Billy Jones  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from SevenBridges import *\n",
    "dm = apply_data_model(school_data, data_model, \"student_name\")\n",
    "dm.T.sort_values([('node')], ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes_to_make, relationships_to_make = create_nodes_and_relationships(dm, data_model)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(n:Class {subject : \"True\", grade : \"43.0\"}),\n",
       " (n:Class {subject : \"True\", grade : \"39.0\"}),\n",
       " (n:Class {subject : \"True\", grade : \"49.0\"}),\n",
       " (n:Person:Parent:Father {name : \"Helen Billings\", age : \"Birth\"}),\n",
       " (n:Person:Parent:Father {name : \"Mary Jones\", age : \"Birth\"}),\n",
       " (n:Person:Parent:Father {name : \"Helen Camp\", age : \"Birth\"}),\n",
       " (n:Person:Parent:Mother {name : \"1234 Harvard Way, Chattanooga TN 35761\", age : \"Notre Dame High School\"}),\n",
       " (n:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}),\n",
       " (n:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}),\n",
       " (n:Person:Parent:Mother {name : \"1234 Harvard Way, Chattanooga TN 35761\", age : \"Notre Dame High School\"}),\n",
       " (n:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}),\n",
       " (n:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}),\n",
       " (n:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}),\n",
       " (n:Person:Student {class_grade : \"True\"}),\n",
       " (n:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}),\n",
       " (n:Person:Teacher {name : \"52\", degree : \"Paul Billings\", employment_date : \"Step\"}),\n",
       " (n:Person:Teacher {name : \"49\", degree : \"Gary Carell\", employment_date : \"Birth\"}),\n",
       " (n:Person:Teacher {name : \"32\", degree : \"Bob Jones\", employment_date : \"Birth\"}),\n",
       " (n:Person:Teacher {name : \"32\", degree : \"Ace Colbert\", employment_date : \"Step\"}),\n",
       " (n:Person:Teacher {name : \"72\", degree : \"Paul Camp\", employment_date : \"Birth\"}),\n",
       " (n:School {name : \"2/01/2001\", address : \"3.7\"}),\n",
       " (n:School {name : \"12/01/2003\", address : \"2.9\"}),\n",
       " (n:School {name : \"12/01/2004\", address : \"3.2\"}),\n",
       " (n:School {name : \"12/01/2003\", address : \"2.9\"}),\n",
       " (n:School {name : \"12/01/2001\", address : \"3.8\"})]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nodes_to_make"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[MATCH (a:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}), (b:Class {subject : \"True\", grade : \"43.0\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}), (b:School {name : \"2/01/2001\", address : \"3.7\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"52\", degree : \"Paul Billings\", employment_date : \"Step\"}), (b:Class {subject : \"True\", grade : \"43.0\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"12\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"52\", degree : \"Paul Billings\", employment_date : \"Step\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {subject : \"True\", grade : \"43.0\"}), (b:School {name : \"2/01/2001\", address : \"3.7\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"Matt Billings\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {name : \"Helen Billings\", age : \"Birth\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Math\", pickup : \"08/01/1998\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Harvard Way, Chattanooga TN 35761\", age : \"Notre Dame High School\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Fisher\", pickup : \"15.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}), (b:School {name : \"12/01/2003\", address : \"2.9\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {class_grade : \"True\"}), (b:School {name : \"12/01/2003\", address : \"2.9\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"49\", degree : \"Gary Carell\", employment_date : \"Birth\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"49\", degree : \"Gary Carell\", employment_date : \"Birth\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Ace Colbert\", employment_date : \"Step\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Ace Colbert\", employment_date : \"Step\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Freeley\", pickup : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Freeley\", pickup : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}), (b:Class {subject : \"True\", grade : \"39.0\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}), (b:School {name : \"12/01/2004\", address : \"3.2\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Bob Jones\", employment_date : \"Birth\"}), (b:Class {subject : \"True\", grade : \"39.0\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"9\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Bob Jones\", employment_date : \"Birth\"}), (b:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {subject : \"True\", grade : \"39.0\"}), (b:School {name : \"12/01/2004\", address : \"3.2\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"Jesse Jones\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {name : \"Mary Jones\", age : \"Birth\"}), (b:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"English\", pickup : \"08/01/1999\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}), (b:Person:Student {name : \"12.0\", dob : \"English\", grade : \"43.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Marie Daily\", pickup : \"3.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}), (b:School {name : \"12/01/2003\", address : \"2.9\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {class_grade : \"True\"}), (b:School {name : \"12/01/2003\", address : \"2.9\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"49\", degree : \"Gary Carell\", employment_date : \"Birth\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"49\", degree : \"Gary Carell\", employment_date : \"Birth\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Ace Colbert\", employment_date : \"Step\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"32\", degree : \"Ace Colbert\", employment_date : \"Step\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}), (b:Person:Student {name : \"11.0\", dob : \"American History\", grade : \"423.0\", class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Freeley\", pickup : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Jones Road, Nashville TN 35761\", age : \"Sudden Valley High School\"}), (b:Person:Student {class_grade : \"True\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Freeley\", pickup : \"1.0\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}), (b:Class {subject : \"True\", grade : \"49.0\"}) MERGE (a)-[r:_IS_MEMBER_OF_]->(b) RETURN r,\n",
       " MATCH (a:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}), (b:School {name : \"12/01/2001\", address : \"3.8\"}) MERGE (a)-[r:_ATTENDS_]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"72\", degree : \"Paul Camp\", employment_date : \"Birth\"}), (b:Class {subject : \"True\", grade : \"49.0\"}) MERGE (a)-[r:_TEACHES_ {years_teaching : \"12\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Teacher {name : \"72\", degree : \"Paul Camp\", employment_date : \"Birth\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}) MERGE (a)-[r:_TEACHES_]->(b) RETURN r,\n",
       " MATCH (a:Class {subject : \"True\", grade : \"49.0\"}), (b:School {name : \"12/01/2001\", address : \"3.8\"}) MERGE (a)-[r:_IS_AT_ {room_number : \"Matt Camp\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Father {name : \"Helen Camp\", age : \"Birth\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Math\", pickup : \"08/01/1998\"}]->(b) RETURN r,\n",
       " MATCH (a:Person:Parent:Mother {name : \"1234 Harvard Way, Chattanooga TN 35761\", age : \"Notre Dame High School\"}), (b:Person:Student {name : \"12.0\", dob : \"Algebra II\", grade : \"303.0\", class_grade : \"False\"}) MERGE (a)-[r:_PARENT_OF_ {parent_type : \"Kathy Fisher\", pickup : \"15.0\"}]->(b) RETURN r]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relationships_to_make"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "uri = \"bolt://127.0.0.1:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"password\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session()\n",
    "for node in nodes_to_make:\n",
    "    session.run(node.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "for rel in relationships_to_make:\n",
    "    session.run(rel.MERGE())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7",
   "language": "python",
   "name": "py3.7"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
